{"/architecture":{"title":"Architecture","data":{"":"The 0rbit architecture is pretty simple and easy to understand if you are aware about the working of the ao processes on the Arweave network.","high-level-overview#High Level Overview":"The 0rbit consists of the following components:","main-ao-process#Main ao process":"The process which user's ao process interacts with to get the data.","0rbit-nodes#0rbit Nodes":"The network of nodes from which a node fetches the request created by the main ao process and then processes it and sends the response back to the main ao process.","step-by-step-flow#Step by Step Flow":"","from-user#From USER":"User's ao process sends a request to the main ao process.","publishing-request-on-arweave#Publishing request on Arweave":"The main ao process then sends the request transaction data to the Arweave network.","fetching-the-request#Fetching the request":"One of the nodes from the 0rbit Nodes network fetches the request transaction data.","processing-the-request#Processing the request":"The nodes processes the request.","collecting-the-response#Collecting the response":"The nodes fetches the response from the ISP.","decentralized-0racle-network#Decentralized 0racle Network":"The values are then cross-checked within the 0rbit Nodes network and then the response is generated and published on Arweave Network.","receiving-the-response#Receiving the response":"One of nodes sends the response to the user's ao process."}},"/architecture/main_ao_process":{"title":"Main ao process","data":{"":"Coming soon 👀"}},"/examples/basic-get-request":{"title":"Your First Get Request","data":{"":"Create your first Get request using the 0rbitAt core 0rbit is a ao process, which means it can be used by an ao process.","prerequisite#Prerequisite":"Basic understanding of ao\nBasic understanding of Arweave.","install-aos#Install AOS":"","install-aos-1#Install AOS":"npm i -g https://get_ao.g8way.io\nAOS is the environment that helps to create and compile ao process.","initialize-the-aos#Initialize the AOS":"aos\nThis will create an ao process for your local machine to interact with the ao processes.","aos-editor#AOS Editor":"","start-the-editor#Start the editor":".editor\nThis will start the editor for you to write the commands to interact with the ao processes.","command-to-interact-with-the-ao-processes#Command to interact with the ao processes":"","create-a-variable#Create a variable":"GET_0RBIT= \"-o7N0dtFKGZpnitaM7WpKHo6uwZ8KUarugK7RABQmrM\"\nThis will create a variable GET_0RBIT and assign the value of the process ID of the 0rbit's GET ao process.","create-a-get-request#Create a Get request":"Send({\n    Target = GET_0RBIT,\n    Action = \"Get-Real-Data\",\n    Url = \"https://dummyjson.com/products\"\n})\nIn this command:\nTARGET is the process ID of the ao process user wants to interact with, which in this case is 0rbit's GET ao process.\nAction is the specific tag required by 0rbit to perform the Get request.\nUrl is the URL of the website from which we want to get the data.\nThis will create a Get request and send it to the 0rbit's GET ao process.","send-the-command#Send the command":".done\nThis will end your editor session, compile the commands and execute it.","check-the-inbox#Check the Inbox":"After sending the request, you can check the inbox of your ao process to see the response from the 0rbit.Just type the following command in the terminal:\n#Inbox\nFor this particular example, the response from the 0rbit will be a number of products.\nAt last your terminal will look like this👇🏻","it-has-received-the-response-from-the-0rbit#It has received the response from the 0rbit.":"Voila! You have successfully created your first Get request to the 0rbit. 🎉🎉"}},"/architecture/orbit_nodes":{"title":"Orbit Nodes","data":{"":"Coming soon 👀"}},"/":{"title":"Introduction","data":{"":"0rbit is a decentralised, permissionless and censorship-resistant oracle network built on top of Arweave using ao.\nArweave is a decentralized permanent data storage network.Recently, Arweave announced the release of the AO computer on the Arweave Network.This is a big step forward for the Arweave Ecosystem as it will enable developers to build smart contracts that can interact with each other on the Arweave Network.\n0rbit takes this to a whole new level by providing a decentralized Oracle network that developers can use to build smart contracts that interact with the real world.0rbit helps bring ANY DATA from both the on-chain and off-chain world to the ao process through a decentralized network of 0rbit Nodes."}},"/fetch-http-data":{"title":"Fetch HTTP Data","data":{"":"0rbit helps in bringing any data from both off-chain and on-chain world, and to bring better DevX we have built a simple HTTP function within our main ao process to fetch data from any HTTP endpoint.","how-it-works#How it works?":"The architecture of receiving the data from any HTTP URL is really simple.When a request is made from the ao process to the 0rbit's ao process, the following happens:","step-1#Step 1":"Your ao process sends the request to the 0rbit's ao process with the special tag, i.e., Get-Real-Data.","step-2#Step 2":"0rbit's ao process checks the tags of the request and then publishes the data on the Arweave Network","step-3#Step 3":"0rbit's Decentralized 0rcale Network fetches the request, process the request data and publish the response on the Arweave Network.","step-4#Step 4":"One of the 0rbit Nodes sends the data to the user's ao process."}}}